Revit 2024 API
ThermalAsset.ElectricalResistivity Property
 The electrical resistivity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double ElectricalResistivity { get; set; }
Visual Basic
Public Property ElectricalResistivity As Double
	Get
	Set
Visual C++
public:
property double ElectricalResistivity {
	double get ();
	void set (double value);
}
Remarks
 Values are in ohm-meters and must be non-negative.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for electricalResistivity must be non-negative.
See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace